## Working with Text data split () method and working with delimeter

In [5]:
import pandas as pd
import numpy as np

import seaborn as sb

In [6]:
import matplotlib.pyplot as plt

In [7]:
data = pd.read_csv("chicago.csv")

data.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [8]:
data.info

<bound method DataFrame.info of                       Name            Position Title        Department  \
0          AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT
1        AARON,  JEFFERY M            POLICE OFFICER            POLICE
2           AARON,  KARINA            POLICE OFFICER            POLICE
3      AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES
4      ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT
...                    ...                       ...               ...
32058   ZYGOWICZ,  PETER J            POLICE OFFICER            POLICE
32059    ZYMANTAS,  MARK E            POLICE OFFICER            POLICE
32060  ZYRKOWSKI,  CARLO E            POLICE OFFICER            POLICE
32061  ZYSKOWSKI,  DARIUSZ   CHIEF DATA BASE ANALYST              DoIT
32062                  NaN                       NaN               NaN

      Employee Annual Salary
0                  $90744.00
1                  $84450.00
2                  $84450.00
3                  $89880.00
4                 $106836.00
...                      ...
32058              $87384.00
32059              $84450.00
32060              $87384.00
32061             $113664.00
32062                    NaN

[32063 rows x 4 columns]>

In [10]:
data.describe()

                     Name  Position Title Department Employee Annual Salary
count               32062           32062      32062                  32062
unique              31776            1093         35                   1156
top     KELLY,  MICHAEL J  POLICE OFFICER     POLICE              $87384.00
freq                    4            9184      12618                   2394

In [11]:
data.shape

(32063, 4)

In [14]:
data.columns

Index(['Name', 'Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [17]:
data.duplicated().sum()

9

In [52]:
" Hello today is Tuesday".split()

['Hello', 'today', 'is', 'Tuesday']

In [54]:
data["Name"].str.split(",")

0            [AARON,   ELVIA J]
1          [AARON,   JEFFERY M]
2             [AARON,   KARINA]
3        [AARON,   KIMBERLEI R]
4        [ABAD JR,   VICENTE M]
                  ...
32058     [ZYGOWICZ,   PETER J]
32059      [ZYMANTAS,   MARK E]
32060    [ZYRKOWSKI,   CARLO E]
32061    [ZYSKOWSKI,   DARIUSZ]
32062                       NaN
Name: Name, Length: 32063, dtype: object

In [55]:
data["Name"].str.split(",").str.get(0)

0            AARON
1            AARON
2            AARON
3            AARON
4          ABAD JR
           ...
32058     ZYGOWICZ
32059     ZYMANTAS
32060    ZYRKOWSKI
32061    ZYSKOWSKI
32062          NaN
Name: Name, Length: 32063, dtype: object

In [56]:
data["Name"].str.split(",").str.get(0).str.title()

0            Aaron
1            Aaron
2            Aaron
3            Aaron
4          Abad Jr
           ...
32058     Zygowicz
32059     Zymantas
32060    Zyrkowski
32061    Zyskowski
32062          NaN
Name: Name, Length: 32063, dtype: object

In [58]:
# check common last name

data["Name"].value_counts()

KELLY,  MICHAEL J        4
PEREZ,  JOSE A           4
ROMERO,  MIGUEL A        4
RIVERA,  RICARDO         4
HERNANDEZ,  JUAN C       4
                        ..
PUGLIESE,  STEFANIE      1
SCUDIERO,  PATRICIA A    1
BARTUCH JR,  JOHN J      1
ALSTON,  ETTA E          1
CLARK,  DEONDRE          1
Name: Name, Length: 31776, dtype: int64

In [59]:
data["Name"].str.split(",").str.get(0).str.title().value_counts()

Williams         293
Johnson          244
Smith            241
Brown            185
Jones            183
                ...
De Alejandro       1
Vuletic            1
Pellikan           1
Bertola            1
Van Den Bosch      1
Name: Name, Length: 13829, dtype: int64

In [64]:
data["Position Title"].str.split(" ").str.get(1)# extract index position

0            RATE
1         OFFICER
2         OFFICER
3        CONTRACT
4        ENGINEER
           ...
32058     OFFICER
32059     OFFICER
32060     OFFICER
32061        DATA
32062         NaN
Name: Position Title, Length: 32063, dtype: object

In [65]:
data["Position Title"].str.split(" ").str.get(1).value_counts() # the top title begin with

OFFICER           10400
LABORER            1538
MOTOR               918
GUARD               775
TRUCK               721
                  ...
SHELTER               1
SUPPORT               1
COM                   1
CLASSIFICATION        1
RENTAL                1
Name: Position Title, Length: 285, dtype: int64

In [66]:
# Create dataframe from name

data["Name"].str.split(",",expand =True)

               0              1
0          AARON        ELVIA J
1          AARON      JEFFERY M
2          AARON         KARINA
3          AARON    KIMBERLEI R
4        ABAD JR      VICENTE M
...          ...            ...
32058   ZYGOWICZ        PETER J
32059   ZYMANTAS         MARK E
32060  ZYRKOWSKI        CARLO E
32061  ZYSKOWSKI        DARIUSZ
32062        NaN            NaN

[32063 rows x 2 columns]

In [70]:
## concate name col to data frame

data[["First Name", "Last Name"]] = data["Name"].str.split(",", expand = True)
data.head(2)

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M

In [71]:
# split col with space

data["Position Title"].str.split(" ")

0                [WATER, RATE, TAKER]
1                   [POLICE, OFFICER]
2                   [POLICE, OFFICER]
3        [CHIEF, CONTRACT, EXPEDITER]
4               [CIVIL, ENGINEER, IV]
                     ...
32058               [POLICE, OFFICER]
32059               [POLICE, OFFICER]
32060               [POLICE, OFFICER]
32061    [CHIEF, DATA, BASE, ANALYST]
32062                             NaN
Name: Position Title, Length: 32063, dtype: object

In [73]:
data["Position Title"].str.split(" ",expand =True, n=1)

            0                   1
0       WATER          RATE TAKER
1      POLICE             OFFICER
2      POLICE             OFFICER
3       CHIEF  CONTRACT EXPEDITER
4       CIVIL         ENGINEER IV
...       ...                 ...
32058  POLICE             OFFICER
32059  POLICE             OFFICER
32060  POLICE             OFFICER
32061   CHIEF   DATA BASE ANALYST
32062     NaN                 NaN

[32063 rows x 2 columns]

In [74]:
data[["First Title Word","Remaining Words"]]= data["Position Title"].str.split(" ",expand =True, n=1)
data.head(3)

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name,First Title Word,Remaining Words
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA,POLICE,OFFICER

## Working with data and time module

In [20]:
import datetime as dt

In [22]:
today = dt.date(2022,5,4)

print (today.year)
print(today.month)
print(today.day)

2022
5
4

In [24]:
str(today)

'2022-05-04'

In [28]:
today = dt.datetime(2022,5,4,17,13,57)

print(today.year)
print(today.hour)
print(today.minute)
print(today.second)

2022
17
13
57

## Timestamp Object

In [29]:
pd.Timestamp("2015-03-31")
pd.Timestamp("2015/03/31")
pd.Timestamp("2013, 11, 04")
pd.Timestamp("1/1/2015")
pd.Timestamp("19/12/2015")
pd.Timestamp("12/19/2015")
pd.Timestamp("4/3/2000")
pd.Timestamp("2021-03-08 08:35:15")
pd.Timestamp("2021-03-08 6:13:29 PM")

Timestamp('2021-03-08 18:13:29')

In [31]:
pd.Timestamp(dt.date(2015,1,1))

Timestamp('2015-01-01 00:00:00')

In [32]:
pd.Timestamp(dt.datetime(2000, 2, 3, 21, 35, 22))

Timestamp('2000-02-03 21:35:22')

## Pandas Datetime index object

In [33]:
dates = ["2016/01/02", "2016/04/12", "2009/09/07"]
pd.DatetimeIndex(dates)

DatetimeIndex(['2016-01-02', '2016-04-12', '2009-09-07'], dtype='datetime64[ns]', freq=None)

In [35]:
dates = [dt.date(2016, 1, 10), dt.date(1994, 6, 13), dt.date(2003, 12, 29)]
dtIndex = pd.DatetimeIndex(dates)

values = [100, 200, 300]
pd.Series(data = values, index = dtIndex)

2016-01-10    100
1994-06-13    200
2003-12-29    300
dtype: int64

## pd.to_datetime() Method

In [36]:
pd.to_datetime("2001-04-19")
pd.to_datetime(dt.date(2015, 1, 1))
pd.to_datetime(dt.datetime(2015, 1, 1, 14, 35, 20))
pd.to_datetime(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [37]:
times = pd.Series(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])
times

0        2015-01-03
1        2014/02/08
2              2016
3    July 4th, 1996
dtype: object

In [38]:
pd.to_datetime(times)

0   2015-01-03
1   2014-02-08
2   2016-01-01
3   1996-07-04
dtype: datetime64[ns]

In [39]:
dates = pd.Series(["July 4th, 1996", "10/04/1991", "Hello", "2015-02-31"])
dates

0    July 4th, 1996
1        10/04/1991
2             Hello
3        2015-02-31
dtype: object

In [40]:
pd.to_datetime(dates, errors = "coerce")

0   1996-07-04
1   1991-10-04
2          NaT
3          NaT
dtype: datetime64[ns]

In [41]:
pd.to_datetime([1349720105, 1349806505, 1349892905, 1349979305, 1350065705], unit = "s")

DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05',
               '2012-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)

In [42]:
pd.Period("2016-01-08", freq = "10D")

Period('2016-01-08', '10D')

In [43]:
dates = ["2016-01-01", "2016-02-01", "2016-03-01"]
pd.Series([1, 2, 3], index = pd.PeriodIndex(dates, freq = "2M"))

2016-01    1
2016-02    2
2016-03    3
Freq: 2M, dtype: int64

In [44]:
pd.Period("2016-01-08", freq = "W")
pd.Period("2016-01-08", freq = "W-SUN")
pd.Period("2016-01-08", freq = "W-WED")
pd.Period("2015-12-10", freq = "10D")

dates = ["2016-01-01", "2016-02-01", "2016-02-01"]
pd.PeriodIndex(dates, freq = "W-MON")
weeks = pd.PeriodIndex(dates, freq = "W-MON")

pd.Series([999, 500, 325], index = weeks, name = "Weekly Revenue")

2015-12-29/2016-01-04    999
2016-01-26/2016-02-01    500
2016-01-26/2016-02-01    325
Freq: W-MON, Name: Weekly Revenue, dtype: int64

## create range of date with pd.date_range() method

In [47]:
times = pd.date_range(start = "2016-01-01", end = "2016-01-10", freq = "D")

times

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

In [48]:
type(times)

pandas.core.indexes.datetimes.DatetimeIndex

In [50]:
type(times[0])

pandas._libs.tslibs.timestamps.Timestamp

In [51]:
pd.date_range(start = "2016-01-01", end = "2050-01-01", freq = "A")

DatetimeIndex(['2016-12-31', '2017-12-31', '2018-12-31', '2019-12-31',
               '2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31',
               '2024-12-31', '2025-12-31', '2026-12-31', '2027-12-31',
               '2028-12-31', '2029-12-31', '2030-12-31', '2031-12-31',
               '2032-12-31', '2033-12-31', '2034-12-31', '2035-12-31',
               '2036-12-31', '2037-12-31', '2038-12-31', '2039-12-31',
               '2040-12-31', '2041-12-31', '2042-12-31', '2043-12-31',
               '2044-12-31', '2045-12-31', '2046-12-31', '2047-12-31',
               '2048-12-31', '2049-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')